# Время жизни токена
JWT_LIFETIME_SECONDS = 1600

# Числовые константы
THREE = 3

# Максимальная и минимальная длинна телефона
MAX_TEL = 15
MIN_TEL = 5

# Максимальная и минимальная длина названия кафе
MAX_NAME_CAFE = 256
MIN_NAME_CAFE = 5

# Максимальная и минимальная длинна адреса кафе
MAX_ADDRESS = 256
MIN_ADDRESS = 5

# Описание тэгов
TAGS_METADATA = [
    {
        'name': 'Пользователи',
        'description': 'Управление пользователями сервиса'
    },
    {
        'name': 'Аутентификация',
        'description': 'Аутентификация пользователя'
    },
    {
        'name': 'Кафе',
        'description': 'Управление кафе'
    },
    {
        'name': 'Столы',
        'description': 'Управление столами'
    },
    {
        'name': 'Временные слоты',
        'description': 'Управление временными слотами'
    },
]
